1521716/stm32-learning/STM32Projects/复习_2026_08_08/模块三_定时器PWM输出/同定时器双周期呼吸灯/Hardware/PWM.c
#include "stm32f10x.h"                  // Device header


/**
  * @brief  初始化PWM输出
  * @param  无
  * @retval  无
  定时器2通道一输出
  */
void PWM_Init(void)
{
	// RCC开启时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	// 配置GPIO
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	// 选择时钟源
	TIM_InternalClockConfig(TIM2);
	
	// 配置时基单元
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 100 - 1;
	TIM_TimeBaseInitStructure.TIM_Prescaler = 720 - 1;
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseInitStructure);
	
	// 设置输出比较通道
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 0;
	TIM_OC1Init(TIM2,&TIM_OCInitStructure);
	TIM_OC2Init(TIM2,&TIM_OCInitStructure);
	
	// 使能定时器
	TIM_Cmd(TIM2,ENABLE);
}


/**
  * @brief  设置通道一的CCR
  * @param  Compare 设置的CCR
  * @retval  无
  */
void PWM_SetCompare1(uint8_t Compare)
{
	TIM_SetCompare1(TIM2,Compare);
}

/**
  * @brief  设置通道二的CCR
  * @param  Compare 设置的CCR
  * @retval  无
  */
void PWM_SetCompare2(uint8_t Compare)
{
	TIM_SetCompare2(TIM2,Compare);
}
